blog/2018/04/01/fabric-marbles/index.html
<!DOCTYPE html>
<html lang="en">
<head>
  <title>Fabric Marbles 分析 - Pinvon&#39;s Blog</title>
  <meta charset="utf-8" />
  <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
  <meta name="viewport"
        content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no"/>
  <meta name="author" content="Pinvon" />
  <meta name="description" content="&lt;TODO: insert your description here&gt;" />
  <meta name="keywords" content="BlockChain" />
  <link rel="stylesheet" href="https://pinvondev.github.io/media/css/main.css" type="text/css"/>
  <link rel="stylesheet" href="https://pinvondev.github.io/media/css/comment.css" type="text/css"/>
</head>

  <body><div class="container">
<div>
  <header class="masthead">
    <h1 class="masthead-title"><a href="https://pinvondev.github.io/">Pinvon&#39;s Blog</a></h1>
    <p>所见, 所闻, 所思, 所想</p>
    <nav class="site-nav">
      <div class="menu-icon">
        <svg viewBox="0 0 18 15">
          <path d="M18,1.484c0,0.82-0.665,1.484-1.484,1.484H1.484C0.665,2.969,0,2.304,0,1.484l0,0C0,0.665,0.665,0,1.484,0 h15.031C17.335,0,18,0.665,18,1.484L18,1.484z" fill="#ffff00"/>
          <path d="M18,7.516C18,8.335,17.335,9,16.516,9H1.484C0.665,9,0,8.335,0,7.516l0,0c0-0.82,0.665-1.484,1.484-1.484 h15.031C17.335,6.031,18,6.696,18,7.516L18,7.516z" fill="#ffff00"/>
          <path d="M18,13.516C18,14.335,17.335,15,16.516,15H1.484C0.665,15,0,14.335,0,13.516l0,0 c0-0.82,0.665-1.484,1.484-1.484h15.031C17.335,12.031,18,12.696,18,13.516L18,13.516z" fill="#ffff00"/>
        </svg>
      </div>
      <ul class="trigger">
        <li><a href="https://pinvondev.github.io/years/">Years</a></li>
        <li><a href="https://pinvondev.github.io/authors/">Authors</a></li>
        <li><a href="https://pinvondev.github.io/tags/">Tags</a></li>
        <li><a href="https://pinvondev.github.io/about/">About</a></li>
        <li><a href="https://github.com/pinvondev">Github</a></li>
        <li><a href="https://pinvondev.github.io/rss.xml">RSS</a></li>
      </ul>
    </nav>
    <form method="get" id="searchform" action="http://www.google.com/search">
      <input type="text" class="field" name="q" id="s" placeholder="Search">
      <input type="hidden" name="as_sitesearch" value="pinvondev.github.io">
    </form>
  </header>
</div>

<div>
<div class="post">
<h1 class="title">Fabric Marbles 分析</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9199ef5">chaincode</a>
<ul>
<li><a href="#org08be7da">chaincode 主要结构</a></li>
<li><a href="#org7fb3e1f">Invoke() 接口</a>
<ul>
<li><a href="#org69b5a82">读账本 read()</a></li>
<li><a href="#orgff2b6d0">写账本 write()</a></li>
<li><a href="#org3636a70">删除 delete_marble()</a></li>
<li><a href="#org2d8e2e9">初始化 init_marble()</a></li>
<li><a href="#orgb3e219e">设置所有者 set_owner()</a></li>
<li><a href="#org4f2af5b">初始化所有者 init_owner()</a></li>
<li><a href="#orga011ee8">读取所有数据 read_everything()</a></li>
<li><a href="#org5ceb466">获取历史数据 getHistory()</a></li>
<li><a href="#org902ea0b">根据范围查找 getMarblesByRange()</a></li>
<li><a href="#org3455b51">disable_owner()</a></li>
<li><a href="#org4a241ac">小结</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5ac005d">运维</a>
<ul>
<li><a href="#org03ff2cd">SDK</a>
<ul>
<li><a href="#org2acabf5">Install Chaincode</a></li>
<li><a href="#org93d43aa">Instantiate Chaincode</a></li>
<li><a href="#org55ecb09">Upgrade Chaincode</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf14dd44">上传步数</a>
<ul>
<li><a href="#org50b90ff">赚取运动能量的公式</a></li>
<li><a href="#org8f62895">SDK</a>
<ul>
<li><a href="#orgddfbdb2">Invoke Chaincode</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org259ad77">查询</a>
<ul>
<li><a href="#orgf031131">SDK</a>
<ul>
<li><a href="#orgd8450d3">Query Chaincode</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga2275bd">错误</a>
<ul>
<li><a href="#org0fa0441">Error: Error endorsing chaincode: rpc error: code = Unknown desc = failed to execute transaction: timeout expired while executing transaction</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9199ef5" class="outline-2">
<h2 id="org9199ef5">chaincode</h2>
<div class="outline-text-2" id="text-org9199ef5">
</div>
<div id="outline-container-org08be7da" class="outline-3">
<h3 id="org08be7da">chaincode 主要结构</h3>
<div class="outline-text-3" id="text-org08be7da">
<div class="org-src-container">
<pre class="src src-Golang">// 声明包
package main

// 引入需要使用的包
import (
    "fmt"
    "strconv"

    "github.com/hyperledger/fabric/core/chaincode/shim"
    pb "github.com/hyperledger/fabric/protos/peer"
)

// 声明 SimpleChaincode 结构体
type SimpleChaincode struct {
}

// 定义资产, 在账本中将会存储 marble 和 owner

// 定义 marble 结构体
// 后面跟着的 json 表示将结构体序列化成 JSON 格式时的键名
type Marble struct {
    ObjectType string        `json:"docType"` //field for couchdb
    Id       string          `json:"id"`      //the fieldtags are needed to keep case from bouncing around
    Color      string        `json:"color"`
    Size       int           `json:"size"`    //size in mm of marble
    Owner      OwnerRelation `json:"owner"`
}

// 定义 owner 结构体
type Owner struct {
    ObjectType string `json:"docType"`     //field for couchdb
    Id         string `json:"id"`
    Username   string `json:"username"`
    Company    string `json:"company"`
    Enabled    bool   `json:"enabled"`     //disabled owners will not be visible to the application
}

type OwnerRelation struct {
    Id         string `json:"id"`
    Username   string `json:"username"`    //this is mostly cosmetic/handy, the real relation is by Id not Username
    Company    string `json:"company"`     //this is mostly cosmetic/handy, the real relation is by Id not Company
}

// 入口函数
func main() {
    err := shim.Start(new(SimpleChaincode))
    if err != nil {
        fmt.Printf("Error starting Simple chaincode - %s", err)
    }
}

// Init() 接口, 用于初始化 chaincode
func (t *SimpleChaincode) Init(stub shim.ChaincodeStubInterface) pb.Response {
    fmt.Println("Marbles Is Starting Up")
    funcName, args := stub.GetFunctionAndParameters()  // 获取 SDK 传入的函数名和参数
    var number int
    var err error
    txId := stub.GetTxID()  // 获取构建交易提案时生成的交易ID

    fmt.Println("Init() is running")
    fmt.Println("Transaction ID:", txId)
    fmt.Println("  GetFunctionAndParameters() function:", funcName)
    fmt.Println("  GetFunctionAndParameters() args count:", len(args))
    fmt.Println("  GetFunctionAndParameters() args found:", args)

    // expecting 1 arg for instantiate or upgrade
    if len(args) == 1 {
        fmt.Println("  GetFunctionAndParameters() arg[0] length", len(args[0]))

        // args 的长度为 0 时, 用于升级 chaincode, 此处未实现
        if len(args[0]) == 0 {
            fmt.Println("  Uh oh, args[0] is empty...")
        } else {
            fmt.Println("  Great news everyone, args[0] is not empty")

            // convert numeric string to integer
            number, err = strconv.Atoi(args[0])
            if err != nil {
                return shim.Error("Expecting a numeric string argument to Init() for instantiate")
            }

            // 测试写入账本
            err = stub.PutState("selftest", []byte(strconv.Itoa(number)))
            if err != nil {
                return shim.Error(err.Error())                  //self-test fail
            }
        }
    }

    // showing the alternative argument shim function
    alt := stub.GetStringArgs()
    fmt.Println("  GetStringArgs() args count:", len(alt))
    fmt.Println("  GetStringArgs() args found:", alt)

    // store compatible marbles application version
    err = stub.PutState("marbles_ui", []byte("4.0.1"))
    if err != nil {
        return shim.Error(err.Error())
    }

    fmt.Println("Ready for action")                          //self-test pass
    return shim.Success(nil)
}

// Invoke() 接口
func (t *SimpleChaincode) Invoke(stub shim.ChaincodeStubInterface) pb.Response {
    function, args := stub.GetFunctionAndParameters()
    fmt.Println(" ")
    fmt.Println("starting invoke, for - " + function)

    // 根据传入的参数来确定调用哪些方法
    if function == "init" {                    //initialize the chaincode state, used as reset
        return t.Init(stub)
    } else if function == "read" {             //generic read ledger
        return read(stub, args)
    } else if function == "write" {            //generic writes to ledger
        return write(stub, args)
    } else if function == "delete_marble" {    //deletes a marble from state
        return delete_marble(stub, args)
    } else if function == "init_marble" {      //create a new marble
        return init_marble(stub, args)
    } else if function == "set_owner" {        //change owner of a marble
        return set_owner(stub, args)
    } else if function == "init_owner"{        //create a new marble owner
        return init_owner(stub, args)
    } else if function == "read_everything"{   //read everything, (owners + marbles + companies)
        return read_everything(stub)
    } else if function == "getHistory"{        //read history of a marble (audit)
        return getHistory(stub, args)
    } else if function == "getMarblesByRange"{ //read a bunch of marbles by start and stop id
        return getMarblesByRange(stub, args)
    } else if function == "disable_owner"{     //disable a marble owner from appearing on the UI
        return disable_owner(stub, args)
    }

    // error out
    fmt.Println("Received unknown invoke function name - " + function)
    return shim.Error("Received unknown invoke function name - '" + function + "'")
}

// 查询, 未实现
func (t *SimpleChaincode) Query(stub shim.ChaincodeStubInterface) pb.Response {
    return shim.Error("Unknown supported call - Query()")
}
</pre>
</div>
</div>
</div>
