blog/2018/04/01/fabric-marbles/index.html

<div id="outline-container-org7fb3e1f" class="outline-3">
<h3 id="org7fb3e1f">Invoke() 接口</h3>
<div class="outline-text-3" id="text-org7fb3e1f">
</div>
<div id="outline-container-org69b5a82" class="outline-4">
<h4 id="org69b5a82">读账本 read()</h4>
<div class="outline-text-4" id="text-org69b5a82">
<div class="org-src-container">
<pre class="src src-Golang">func read(stub shim.ChaincodeStubInterface, args []string) pb.Response {
    var key, jsonResp string
    var err error
    fmt.Println("starting read")

    if len(args) != 1 {
        return shim.Error("Incorrect number of arguments. Expecting key of the var to query")
    }

    // input sanitation
    err = sanitize_arguments(args)
    if err != nil {
        return shim.Error(err.Error())
    }

    key = args[0]
    valAsbytes, err := stub.GetState(key)           // 根据 key 获取 value
    if err != nil {
        jsonResp = "{\"Error\":\"Failed to get state for " + key + "\"}"
        return shim.Error(jsonResp)
    }

    fmt.Println("- end read")
    return shim.Success(valAsbytes)                  //send it onward
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgff2b6d0" class="outline-4">
<h4 id="orgff2b6d0">写账本 write()</h4>
<div class="outline-text-4" id="text-orgff2b6d0">
<div class="org-src-container">
<pre class="src src-Golang">func write(stub shim.ChaincodeStubInterface, args []string) pb.Response {
    var key, value string
    var err error
    fmt.Println("starting write")

    if len(args) != 2 {
        return shim.Error("Incorrect number of arguments. Expecting 2. key of the variable and value to set")
    }

    // input sanitation
    err = sanitize_arguments(args)
    if err != nil {
        return shim.Error(err.Error())
    }

    key = args[0]                                   //rename for funsies
    value = args[1]
    err = stub.PutState(key, []byte(value))         // 根据 key 写入 value
    if err != nil {
        return shim.Error(err.Error())
    }

    fmt.Println("- end write")
    return shim.Success(nil)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3636a70" class="outline-4">
<h4 id="org3636a70">删除 delete_marble()</h4>
<div class="outline-text-4" id="text-org3636a70">
<p>
根据 marble 的 id 来删除指定的 marble.
</p>

<div class="org-src-container">
<pre class="src src-Golang">func delete_marble(stub shim.ChaincodeStubInterface, args []string) (pb.Response) {
    fmt.Println("starting delete_marble")

    if len(args) != 2 {
        return shim.Error("Incorrect number of arguments. Expecting 2")
    }

    // input sanitation
    err := sanitize_arguments(args)
    if err != nil {
        return shim.Error(err.Error())
    }

    id := args[0]	// 获取 marble id
    authed_by_company := args[1]

    // get the marble
    marble, err := get_marble(stub, id)  // 调用的是 GetState() 接口
    if err != nil{
        fmt.Println("Failed to find marble by id " + id)
        return shim.Error(err.Error())
    }

    // check authorizing company (see note in set_owner() about how this is quirky)
    if marble.Owner.Company != authed_by_company{
        return shim.Error("The company '" + authed_by_company + "' cannot authorize deletion for '" + marble.Owner.Company + "'.")
    }

    // remove the marble
    err = stub.DelState(id)  // 删除该 marble
    if err != nil {
        return shim.Error("Failed to delete state")
    }

    fmt.Println("- end delete_marble")
    return shim.Success(nil)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2d8e2e9" class="outline-4">
<h4 id="org2d8e2e9">初始化 init_marble()</h4>
<div class="outline-text-4" id="text-org2d8e2e9">
<p>
生成 marble, 并写入账本.
</p>

<div class="org-src-container">
<pre class="src src-Golang">func init_marble(stub shim.ChaincodeStubInterface, args []string) (pb.Response) {
    var err error
    fmt.Println("starting init_marble")

    if len(args) != 5 {
        return shim.Error("Incorrect number of arguments. Expecting 5")
    }

    //input sanitation
    err = sanitize_arguments(args)
    if err != nil {
        return shim.Error(err.Error())
    }

    // SDK 中应填入的一系列参数, 并进行一系列验证
    id := args[0]
    color := strings.ToLower(args[1])
    owner_id := args[3]
    authed_by_company := args[4]
    size, err := strconv.Atoi(args[2])
    if err != nil {
        return shim.Error("3rd argument must be a numeric string")
    }

    //check if new owner exists
    owner, err := get_owner(stub, owner_id)
    if err != nil {
        fmt.Println("Failed to find owner - " + owner_id)
        return shim.Error(err.Error())
    }

    //check authorizing company (see note in set_owner() about how this is quirky)
    if owner.Company != authed_by_company{
        return shim.Error("The company '" + authed_by_company + "' cannot authorize creation for '" + owner.Company + "'.")
    }

    //check if marble id already exists
    marble, err := get_marble(stub, id)
    if err == nil {
        fmt.Println("This marble already exists - " + id)
        fmt.Println(marble)
        return shim.Error("This marble already exists - " + id)  //all stop a marble by this id exists
    }

    //build the marble json string manually
    str := `{
        "docType":"marble", 
        "id": "` + id + `", 
        "color": "` + color + `", 
        "size": ` + strconv.Itoa(size) + `, 
        "owner": {
            "id": "` + owner_id + `", 
            "username": "` + owner.Username + `", 
            "company": "` + owner.Company + `"
        }
    }`
    err = stub.PutState(id, []byte(str))  // 存入账本
    if err != nil {
        return shim.Error(err.Error())
    }

    fmt.Println("- end init_marble")
    return shim.Success(nil)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb3e219e" class="outline-4">
<h4 id="orgb3e219e">设置所有者 set_owner()</h4>
<div class="outline-text-4" id="text-orgb3e219e">
<div class="org-src-container">
<pre class="src src-Golang">func set_owner(stub shim.ChaincodeStubInterface, args []string) pb.Response {
    var err error
    fmt.Println("starting set_owner")

    // this is quirky
    // todo - get the "company that authed the transfer" from the certificate instead of an argument
    // should be possible since we can now add attributes to the enrollment cert
    // as is.. this is a bit broken (security wise), but it's much much easier to demo! holding off for demos sake

    if len(args) != 3 {
        return shim.Error("Incorrect number of arguments. Expecting 3")
    }

    // input sanitation
    err = sanitize_arguments(args)
    if err != nil {
        return shim.Error(err.Error())
    }

    var marble_id = args[0]
    var new_owner_id = args[1]
    var authed_by_company = args[2]
    fmt.Println(marble_id + "-&gt;" + new_owner_id + " - |" + authed_by_company)

    // check if user already exists
    owner, err := get_owner(stub, new_owner_id)
    if err != nil {
        return shim.Error("This owner does not exist - " + new_owner_id)
    }

    // get marble's current state
    marbleAsBytes, err := stub.GetState(marble_id)
    if err != nil {
        return shim.Error("Failed to get marble")
    }

    // 将数据反序列化, 修改后再序列化为 JSON 格式存储
    res := Marble{}
    json.Unmarshal(marbleAsBytes, &amp;res)           //un stringify it aka JSON.parse()

    // check authorizing company
    if res.Owner.Company != authed_by_company{
        return shim.Error("The company '" + authed_by_company + "' cannot authorize transfers for '" + res.Owner.Company + "'.")
    }

    // transfer the marble
    res.Owner.Id = new_owner_id                   //change the owner
    res.Owner.Username = owner.Username
    res.Owner.Company = owner.Company

    // 修改属性后, 序列化为 JSON 格式
    jsonAsBytes, _ := json.Marshal(res)           //convert to array of bytes
    err = stub.PutState(args[0], jsonAsBytes)     // 重新存储到账本
    if err != nil {
        return shim.Error(err.Error())
    }

    fmt.Println("- end set owner")
    return shim.Success(nil)
}
</pre>
</div>
</div>
</div>
