blog/2018/04/01/fabric-marbles/index.html

<div id="outline-container-org4f2af5b" class="outline-4">
<h4 id="org4f2af5b">初始化所有者 init_owner()</h4>
<div class="outline-text-4" id="text-org4f2af5b">
<div class="org-src-container">
<pre class="src src-Golang">func init_owner(stub shim.ChaincodeStubInterface, args []string) pb.Response {
    var err error
    fmt.Println("starting init_owner")

    if len(args) != 3 {
        return shim.Error("Incorrect number of arguments. Expecting 3")
    }

    //input sanitation
    err = sanitize_arguments(args)
    if err != nil {
        return shim.Error(err.Error())
    }

    var owner Owner
    owner.ObjectType = "marble_owner"
    owner.Id =  args[0]
    owner.Username = strings.ToLower(args[1])
    owner.Company = args[2]
    owner.Enabled = true
    fmt.Println(owner)

    //check if user already exists
    _, err = get_owner(stub, owner.Id)
    if err == nil {
        fmt.Println("This owner already exists - " + owner.Id)
        return shim.Error("This owner already exists - " + owner.Id)
    }

    //store user
    ownerAsBytes, _ := json.Marshal(owner)                         //convert to array of bytes
    err = stub.PutState(owner.Id, ownerAsBytes)                    //store owner by its Id
    if err != nil {
        fmt.Println("Could not store user")
        return shim.Error(err.Error())
    }

    fmt.Println("- end init_owner marble")
    return shim.Success(nil)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga011ee8" class="outline-4">
<h4 id="orga011ee8">读取所有数据 read_everything()</h4>
<div class="outline-text-4" id="text-orga011ee8">
<div class="org-src-container">
<pre class="src src-Golang">func read_everything(stub shim.ChaincodeStubInterface) pb.Response {
    type Everything struct {
        Owners   []Owner   `json:"owners"`
        Marbles  []Marble  `json:"marbles"`
    }
    var everything Everything

    // ---- Get All Marbles ---- //
    resultsIterator, err := stub.GetStateByRange("m0", "m9999999999999999999")
    if err != nil {
        return shim.Error(err.Error())
    }
    defer resultsIterator.Close()

    for resultsIterator.HasNext() {
        aKeyValue, err := resultsIterator.Next()
        if err != nil {
            return shim.Error(err.Error())
        }
        queryKeyAsStr := aKeyValue.Key
        queryValAsBytes := aKeyValue.Value
        fmt.Println("on marble id - ", queryKeyAsStr)
        var marble Marble
        json.Unmarshal(queryValAsBytes, &amp;marble)                  //un stringify it aka JSON.parse()
        everything.Marbles = append(everything.Marbles, marble)   //add this marble to the list
    }
    fmt.Println("marble array - ", everything.Marbles)

    // ---- Get All Owners ---- //
    ownersIterator, err := stub.GetStateByRange("o0", "o9999999999999999999")
    if err != nil {
        return shim.Error(err.Error())
    }
    defer ownersIterator.Close()

    for ownersIterator.HasNext() {
        aKeyValue, err := ownersIterator.Next()
        if err != nil {
            return shim.Error(err.Error())
        }
        queryKeyAsStr := aKeyValue.Key
        queryValAsBytes := aKeyValue.Value
        fmt.Println("on owner id - ", queryKeyAsStr)
        var owner Owner
        json.Unmarshal(queryValAsBytes, &amp;owner)                   //un stringify it aka JSON.parse()

        if owner.Enabled {                                        //only return enabled owners
            everything.Owners = append(everything.Owners, owner)  //add this marble to the list
        }
    }
    fmt.Println("owner array - ", everything.Owners)

    //change to array of bytes
    everythingAsBytes, _ := json.Marshal(everything)              //convert to array of bytes
    return shim.Success(everythingAsBytes)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5ceb466" class="outline-4">
<h4 id="org5ceb466">获取历史数据 getHistory()</h4>
<div class="outline-text-4" id="text-org5ceb466">
<div class="org-src-container">
<pre class="src src-Golang">func getHistory(stub shim.ChaincodeStubInterface, args []string) pb.Response {
    type AuditHistory struct {
        TxId    string   `json:"txId"`
        Value   Marble   `json:"value"`
    }
    var history []AuditHistory;
    var marble Marble

    if len(args) != 1 {
        return shim.Error("Incorrect number of arguments. Expecting 1")
    }

    marbleId := args[0]
    fmt.Printf("- start getHistoryForMarble: %s\n", marbleId)

    // Get History
    resultsIterator, err := stub.GetHistoryForKey(marbleId)
    if err != nil {
        return shim.Error(err.Error())
    }
    defer resultsIterator.Close()

    for resultsIterator.HasNext() {
        historyData, err := resultsIterator.Next()
        if err != nil {
            return shim.Error(err.Error())
        }

        var tx AuditHistory
        tx.TxId = historyData.TxId                     //copy transaction id over
        json.Unmarshal(historyData.Value, &amp;marble)     //un stringify it aka JSON.parse()
        if historyData.Value == nil {                  //marble has been deleted
            var emptyMarble Marble
            tx.Value = emptyMarble                 //copy nil marble
        } else {
            json.Unmarshal(historyData.Value, &amp;marble) //un stringify it aka JSON.parse()
            tx.Value = marble                      //copy marble over
        }
        history = append(history, tx)              //add this tx to the list
    }
    fmt.Printf("- getHistoryForMarble returning:\n%s", history)

    //change to array of bytes
    historyAsBytes, _ := json.Marshal(history)     //convert to array of bytes
    return shim.Success(historyAsBytes)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org902ea0b" class="outline-4">
<h4 id="org902ea0b">根据范围查找 getMarblesByRange()</h4>
<div class="outline-text-4" id="text-org902ea0b">
<div class="org-src-container">
<pre class="src src-Golang">func getMarblesByRange(stub shim.ChaincodeStubInterface, args []string) pb.Response {
    if len(args) != 2 {
        return shim.Error("Incorrect number of arguments. Expecting 2")
    }

    startKey := args[0]
    endKey := args[1]

    resultsIterator, err := stub.GetStateByRange(startKey, endKey)
    if err != nil {
        return shim.Error(err.Error())
    }
    defer resultsIterator.Close()

    // buffer is a JSON array containing QueryResults
    var buffer bytes.Buffer
    buffer.WriteString("[")

    bArrayMemberAlreadyWritten := false
    for resultsIterator.HasNext() {
        aKeyValue, err := resultsIterator.Next()
        if err != nil {
            return shim.Error(err.Error())
        }
        queryResultKey := aKeyValue.Key
        queryResultValue := aKeyValue.Value

        // Add a comma before array members, suppress it for the first array member
        if bArrayMemberAlreadyWritten == true {
            buffer.WriteString(",")
        }
        buffer.WriteString("{\"Key\":")
        buffer.WriteString("\"")
        buffer.WriteString(queryResultKey)
        buffer.WriteString("\"")

        buffer.WriteString(", \"Record\":")
        // Record is a JSON object, so we write as-is
        buffer.WriteString(string(queryResultValue))
        buffer.WriteString("}")
        bArrayMemberAlreadyWritten = true
    }
    buffer.WriteString("]")

    fmt.Printf("- getMarblesByRange queryResult:\n%s\n", buffer.String())

    return shim.Success(buffer.Bytes())
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3455b51" class="outline-4">
<h4 id="org3455b51">disable_owner()</h4>
<div class="outline-text-4" id="text-org3455b51">
<div class="org-src-container">
<pre class="src src-Golang">func disable_owner(stub shim.ChaincodeStubInterface, args []string) pb.Response {
    var err error
    fmt.Println("starting disable_owner")

    if len(args) != 2 {
        return shim.Error("Incorrect number of arguments. Expecting 2")
    }

    // input sanitation
    err = sanitize_arguments(args)
    if err != nil {
        return shim.Error(err.Error())
    }

    var owner_id = args[0]
    var authed_by_company = args[1]

    // get the marble owner data
    owner, err := get_owner(stub, owner_id)
    if err != nil {
        return shim.Error("This owner does not exist - " + owner_id)
    }

    // check authorizing company
    if owner.Company != authed_by_company {
        return shim.Error("The company '" + authed_by_company + "' cannot change another companies marble owner")
    }

    // disable the owner
    owner.Enabled = false
    jsonAsBytes, _ := json.Marshal(owner)         //convert to array of bytes
    err = stub.PutState(args[0], jsonAsBytes)     //rewrite the owner
    if err != nil {
        return shim.Error(err.Error())
    }

    fmt.Println("- end disable_owner")
    return shim.Success(nil)
}
</pre>
</div>
</div>
</div>
